      *%METADATA                                                      *
      * %TEXT Log functions                                           *
      *%EMETADATA                                                     *
     d AddLogEntry     pr
     d  entry                       500    value
